Revit 2027 API
LineLightShape.EmitLength Property
 The emit length.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EmitLength { get; set; }
Public Property EmitLength As Double
	Get
	Set
public:
property double EmitLength {
	double get ();
	void set (double value);
}
member EmitLength : float with get, set
Property Value
Double
 The emit length as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
Reference
LineLightShape Class
Autodesk.Revit.DB.Lighting Namespace